package com.example.kirton_song

import android.content.Intent
import android.os.Bundle
import android.widget.ArrayAdapter
import android.widget.ListView
import androidx.appcompat.app.AppCompatActivity
import com.google.android.material.appbar.MaterialToolbar

class MainActivity : AppCompatActivity() {

    private val songList = listOf(
        /* 01 */ "অঙ্গে মাখো মাখো গো এই না ব্রজের ধুলা",
        /* 02 */ "অধিবাস কীর্তন",
        /* 03 */ "আমর মন কেন ডুবেনা",
        /* 04 */ "আমরা দু'টি ভাই",
        /* 05 */ "আর দেরী নাই, হরি বল ভাই",
        /* 06 */ "আয়রে আয় জগা মাধা জয় হরি বলে",
        /* 07 */ "এসেছে ব্রজের বাঁকা, কাল সখা",
        /* 08 */ "কুঞ্জে রাই মিলেছে",
        /* 09 */ "কৃষ্ণ গৌবিন্দ শ্রী মধুসূদন",
        /* 10 */ "জনম পেয়েছ ভাল বলরে গৌর হরি বল",
        /* 11 */ "জয় জয় শ্রী গোরাঙ্গ",
        /* 12 */ "জয় ধ্বনি",
        /* 13 */ "জয় রাধে রাধে কৃষ্ণ কৃষ্ণ",
        /* 14 */ "তিন পয়সাতে হয় যার মেলা, কলিতে ত্রিনাতের মেলা",
        /* 15 */ "তুমি অগতের গতি",
        /* 16 */ "দিন গেলে ত্রিনাতের নাম লইয় সাধুর ভাই",
        /* 17 */ "নামটি বদন ভরে লওরে রাধে গোবিন্দ নাম",
        /* 18 */ "বিপদ বঞ্জন পতিত পাবণ শ্রী মধুসুধন জনার্ধন",
        /* 19 */ "বৃন্দাবন বিলাসিনি, রাই আমাদের",
        /* 20 */ "ভোর কীর্তন",
        /* 21 */ "মন একবার হরিবল হরি বল হরি বল",
        /* 22 */ "মাধা ভয় কিরে তোর আয়রে আমার কাছে আয়",
        /* 23 */ "মাধা যেনে আয় নদিয়ায় কি মধুর ধনি শুনা যায়",
        /* 24 */ "রাধা কানুর মিলন হল",
        /* 25 */ "লুট গান-১",
        /* 26 */ "লুট গান-২",
        /* 27 */ "লুট গান-৩",
        /* 28 */ "লুট গান-৪",
        /* 29 */ "লুট গান-৫",
        /* 30 */ "লুট গান-৬",
        /* 31 */ "লুট গান -৭",
        /* 32 */ "শচী কেন্দে বলে কোথায় রইলি",
        /* 33 */ "হরি দিন ত গেল সন্ধ্যা হল পার কর আমারে",
        /* 34 */ "হরি বলে বাহু তোলে নেছে আয়"
    )

    private val lyricsList = listOf(
        /* 01 - অঙ্গে মাখো মাখো গো এই না ব্রজের ধুলা */
        "অঙ্গে মাখো মাখো গো এই না ব্রজের ধুলা, \n" +
                "ধুলা নয় গো দোলা নয় গো গোপী পাদ রেণু, \n" +
                "এই ধুলা অঙ্গে মাখে নৈদে ব্রজের রাই কানু \n" +
                "অঙ্গে মাখো গো এই না ব্রজের ধুলা। ঐ \n" +
                "সংকীর্ত্তনের ধুলা যদি পরে গঙ্গার জলে, \n" +
                "গঙ্গা পবিত্র হয় ভাগবতে বলে গো, এই না ব্রজের ধুলা, \n" +
                "অঙ্গে মাখো গো এই না ব্রজের ধুলা, \n" +
                "সংকীর্ত্তন এর দোলা যদি লাগে পাপির গায়, \n" +
                "সে পাপী নেছে নেছে বৈকুণ্ঠেতে যায়, \n" +
                "ঐ সংকীর্তনের ধুলা নিয়ে যেবা পথে যায়, \n" +
                "জলে কুমির বনের বাঘ ভয়েতে পালায়, \n" +
                "অঙ্গে মাখো মাখো গো এই না ব্রজের ধুলা \n" +
                "সংকীর্তনের ধুলা নিয়ে যেবা করে হেলা \n" +
                "সর্ব অঙ্গ নষ্ট হয় চক্ষু হয় তার কালা। ঐ \n",

        /* 02 - অধিবাস কীর্তন */
        "শচিমা ডাকিয়া বলে নিতাই শ্রী বাস। \n" +
                "কালিকীর্তন কর, এসে অভাগীনি বাস ॥ \n" +
                "অদ্বৈত আচার্য্যে মোর পনতি বিশেষ, \n" +
                "সপার্সদ আসেন যেন সঙ্গে হরিদাস ॥\n" +
                "নর হরি গদাঁধ র মুরারী মুকুন্দ, \n" +
                "নিমাই লইয়া কর কীর্তন নর্তন ॥\n" +
                "শচী মায়ের আদেশে নিতাই শ্রীবাস, \n" +
                "অহোরাত্র সংকীর্ত্তনের করে অধিবাস ॥\n" +
                "রোপিয়া কদলি বৃক্ষ অতি মনোহরঃ \n" +
                "বারিপূর্ণ কুম্ভ আস্ত্র পল্লবে সুন্দর।\n" +
                "স্থানে স্থানে রাখ রম্ভ আরোপন করি, \n" +
                "বিচিত্র পতাকা তাহে দিল সরিসারি॥\n" +
                "গন্ধ পুষ্পে করতাল মৃদঙ্গ পুজিয়া, \n" +
                "প্রেমেদিল চারিদিকে ফুল ছাড়াইয়া ॥ \n" +
                "প্রসাদি চন্দন মালা জনে জনে দিয়া \n" +
                "অধিবাস কির্ত্তনে গেল সকলে মাতিয়া ॥ \n" +
                "আকাশ ভেদিয়া উঠে, হরি নামের ধ্বনি \n" +
                "দলে দলে নারী গণে দেয় ওলু ধ্বনি ॥\n" +
                "হরি ধ্বনি ওলু ধ্বনি আনন্দ অপার দেখিয়া \n" +
                "আনন্দে আর ধরে না শচী মাতার। \n" +
                "হরি বোল হরি বোল প্রেমানন্দের বাহু তোলে হরি বোল হরি বোল। ঐ",

        /* 03 - আমার মন কেন ডুবেনা */
        "১. আমার মন কেন ডুবেনা পাষাণ গলিত হরি নাম।\n " +
                "ভাইরে পাষাণ গলিত হরি নাম\n" +
                "২. নৈদা হতে আসল গৌর প্রেমের ভাণ্ড লইয়া, \n" +
                "ঘরে ঘরে হরিণাম দিলেন প্রভূ যাচিয়া ॥ ঐ\n" +
                "৩. নাহি জানি তন্ত্রমন্ত্র নাহি জানি সাধনা, \n" +
                "বুঝি আমার কর্ম দোষে ব্রজে যাওয়া হলনা, \n" +
                "বুজি আমারে ভাই। ঐ",

        /* 04 - আমরা দু'টি ভাই */
        "আমরা দু'টি ভাই, তেমন গৌর নিতাই\n" +
                "১. জগন্নাথ ঠাকুরের ছেলে নিত্তি দেখতে পাই। \n" +
                "এমন দেখা আর দেখি নাই, \n" +
                "আছে যাদের আছি তারে এমনা।\n" +
                "২. নিতি নিতি খেলি বেরী এক পাড়াতে থাকি, \n" +
                "তুচ্ছ ভাবে হেলা করে নিমাই নিমাই ডাকি।\n" +
                "৩. শিশু বলে হেলা করে গনি নাই যাহারে, \n" +
                "আজ কেন ভাই মনে লয় তার পায়ে থাকি পরে।\n" +
                "৪. তোর যদি মনে লয় তুই ফিরে যারে ঘরে, \n" +
                "নিতাই চাঁদের সঙ্গে আমি যাব কবিন পরে । ঐ",

        /* 05 - আর দেরী নাই, হরি বল ভাই */
        "আর দেরী নাই হরি বল ভাই পার হয়ে যাই, ভব পারা পার। \n" +
                "মধুর হরি নামে সদায়, বাস প্রেমে নাম মহামন্ত্র যপ অনিবার ॥ ঐ \n" +
                "সম্মুখে তরঙ্গময় মহাভব সিন্ধু, সেই সিন্দু তরিতে তরী কেবল দিন বন্ধু। \n" +
                "ওহে দিন বন্ধু আমায় পার করে দাও ভবসিন্দু, ওহে দিন বন্দু। \n" +
                "ভবমাঝে সঙ্গী হয়ে যারা জুটে ছিল, অসময়ে ফাঁকি দিয়ে তারা পালাইল। \n" +
                "হরি তুমি ভব কর্ণধার, আমি ভব সাগরে দিলাম সাতাঁর। \n" +
                "তুমি অগতির গতি তুমিহে ব্রহ্মাণ্ড প্রতি \n" +
                "তব পদে এই মিনতি ওহে দয়ার। \n" +
                "তাই দিন স'কাতরে ডাকি হে বারে বারে \n" +
                "মুচন কর এই সংসারে মায়ারইন। \n" +
                "শমন এসে দরলে কেশে কি হবে উপায় \n" +
                "হরি তখন তুমি দারাবে যখন শিয়রে শমন দারাবে \n" +
                "তখন তুমি দারাবে, তোমার রাইকিশোরি বামে নিয়ে তখন তুমি দারাবে। ঐ",

        /* 06 - আয়রে আয় জগা মাধা জয় হরি বলে */
        "আয়রে আয় জগা মাধা জয় হরি বলে, \n" +
                "জয় হরি বলেরে মাধা জয় হরি বলে ॥\n" +
                "১. এমন মধুমাখা নাম শুনলে জুরায় ত্বাপিত প্রাণ, \n" +
                "হোকনা কেন পাষাণ হৃদয় নামেতে যাবে গলে ॥\n" +
                "২. আয়রে আয় জগা মাধা জয় হরি বলে, \n" +
                "নামে হেলা কোরনা যাবে ভব যন্ত্রণা।\n" +
                "৩. নাচ দেখিয়ে বাহুতোলে নামেতে নিদান ঝরে। \n" +
                "আয় রে আয় জগা মাধা জয় হরি বলে। ঐ",

        /* 07 - এসেছে ব্রজের বাঁকা, কাল সখা */
        "এসেছে ব্রজের বাঁকা, কাল সলা দেখবি আয় তোদের এ নদিয়ায় " +
                "রং ফিরেছে, ঢং ফিরেছে কালো এখন চিনা দায় ॥ ঐ\n" +
                "১. এখন আর কালো বরণ নাই, রাই রূপে অঙ্গ ঢেকে গৌর হলেন তাই, \n" +
                "সেঁঝে ব্রত ব্রজের রসিক নাগর, এই যে গৌর নাম ধরায় ॥\n" +
                "২. রাই প্রেমের ঋণি হয়েছে গোপিরা তার হাতের বাঁশি, \n" +
                "কেরে নিয়ে বিদায় দিয়াছি। ঐ\n" +
                "৩. এখন রাধা নাম আর সাধবে কিসে তাইতো হরি গুণ গায় ॥ ঐ\n" +
                "৪. বিশ্বরূপ কয় রাই রূপে অঙ্গ ঢেকে ব্যাঙ্গ করা নয়, \n" +
                "কলির জীব উদ্ধারিলে আচগুলেপ্রেম বিলালে তবে খালাস ঋণের দ্বায় ॥ ঐ",

        /* 08 - কুঞ্জে রাই মিলেছে */
        "কুঞ্জে রাই মিলেছে গো শ্যাম সনে, \n" +
                "আলোয় হল নিধুবন রূপের কিরণে। ঐ\n" +
                "১. চন্দ্রর বেষ্ঠিত যেন নক্ষত্র গণে হেরগগনে। \n" +
                "তেমনি ভাবে রাই গিরিল সব সখি গনে। ঐ\n" +
                "২. গাথিয়া বন ফুলের মালা, অতি যতনে অতি যতনে \n" +
                "শ্যামের গলে দিব মালা আনন্দ মনে অতি যতনে। ঐ\n" +
                "৩. শরৎ চন্দ্র রূপ মুঞ্জুরী একই আসনে একই আসনে। \n" +
                "চরন সেবা করছে তারা মুঞ্জুরী গনে। ঐ\n" +
                "৪. রাধা কৃষ্ণের যুগলমিলন, অতি গোপনে অতি গোপনে। \n" +
                "তেমনি ভাবে মিলনহল নিকুঞ্জ বনে। ঐ\n",

        /* 09 - কৃষ্ণ গৌবিন্দ শ্রী মধুসূদন */
        "কৃষ্ণ গোবিন্দ শ্রী মধুসূদন।\n" +
                "রাম নারায়ন হরে হরে।\n" +
                "ভজ রাম নারায়ন হরে হরে।\n" +
                "কৃষ্ণ গোবিন্দ শ্রী মধুসূদন।\n" +
                "রাম নারায়ন হরে হরে।",

        /* 10 - জনম পেয়েছ ভাল বলরে গৌর হরি বল */
        "জনম পেয়েছ ভাল বলরে গৌর হরি বল।\n" +
                "গৌর হরি গৌর হরি বল গৌর হরি বল, \n" +
                "রাজার যে রাজ্যপাট, যেন নাটু, যার নাটহে । \n" +
                "দেখিতে দেখিতে কিছু-নাইরে গৌর হরি বল ॥\n" +
                "হেন মায়া করে যেই পরম, ঈশ্বর রে \n" +
                "তারে মন সদায় কর বলরে গৌর হরি বল।\n" +
                "গোরা দ্বিজ নটরাজে বান্ধহে হৃদয় মাঝেহে। \n" +
                "কি করিবে সংসার শমন রে গৌর হরি বল।\n" +
                "যে প্রেমের লাগি নারদ বৈরাগী \n" +
                "শশ্মানে-শশ্মানে ফিরে শিব রে।\n" +
                "গৌর হরি বল্ ॥ ঐ",

        /* 11 - জয় জয় শ্রী গোরাঙ্গ */
        "জয় জয় শ্রী গোরাঙ্গ বিষ্ণু প্রিয়নাথ \n" +
                "জীবগন প্রতি কর শুভদৃষ্টি-পাত \n" +
                "কর শুভ দৃষ্টি পাত বিষ্ণু প্রিয়া'র নাথ\n" +
                "জীবগণ প্রতি কর শুভ দৃষ্টিপাত",

        /* 12 - জয় ধ্বনি */
        "জয় গুরু শ্রী গুরু প্রেমানন্দে, \n" +
                "হরি হরি বল হরি বল বল হরি, \n" +
                "জয় জয় নিতাই গৌর সীতা নাথ\n" +
                "১. প্রেমানন্দে হরি হরি বল, হরি বল বল হরি। \n" +
                "জয় গৌর বিষ্ণু প্রিয়া\n" +
                "২. প্রেমানন্দে হরি হরি বল, হরি বল বল হরি \n" +
                "জয় জয় রাধা কৃষ্ণ প্রেমানন্দে, \n" +
                "হরি হরি বল হরি বল বল হরি \n" +
                "মধুর প্রেমধ্বনিকহ,\n" +
                " শ্রীরাধে কৃষ্ণ বলে, \n" +
                "প্রভু নিতাই চৈতন্য।",

        /* 13 - জয় রাধে রাধে কৃষ্ণ কৃষ্ণ */
        "জয় রাধে রাধে কৃষ্ণ কৃষ্ণগোবিন্দ গোবিন্দ বলো রে মন\n" +
                "১. ছাড়িয়ে মন কপট চাতুরী বদন ভরিয়া বল হরি হরি। \n" +
                "হরি নাম পরম ব্রহ্ম জীবের মুখ্য ধৰ্ম্ম \n" +
                "অধৰ্ম্ম কুকর্ম ছারো রে মন । ঐ\n" +
                "২. ছারিয়ে মন ভবেরি আশা অজপা নামে রাখরে নিশা \n" +
                "গুরু গৌরাঙ্গ বল বদনে নিতাই গৌরাঙ্গ বল বদনে। \n" +
                "নয়ন নিড়ে ভাসরে মন ॥ ঐ\n" +
                "৩. মনেতে ছিল আজ করিব গৃহবাস, \n" +
                "ত্যাজিয়ে গৃহবাস হইব সন্ন্যাস।\n" +
                "করিব ব্রজে বাস হইব রাইয়ের দাস, \n" +
                "মাধবড়ি মেখে খাবরে মন । ঐ\n" +
                "জয় রাধে রাধে কৃষ্ণ কৃষ্ণ গৌবিন্দ গৌবিন্দ বলরে মন।।",

        /* 14 - তিন পয়সাতে হয় যার মেলা, কলিতে ত্রিনাতের মেলা */
        "তিন পয়সাতে হয় যার মেলা, কলিতে ত্রিনাতের মেলা\n" +
                "১. এক পয়সার পান সুপারি তাতে নাই মসল্যা\n" +
                "পানের খিলি সাধু মিলি বসে বাজায় একতারা। ঐ\n" +
                "২. এক পয়সার তৈল দিয়া তিন বাতি জ্বালাইয়া, \n" +
                "বাতি জ্বলছে ধীরে নিভে নারে প্রভুর নামে নাই সীমা \n" +
                "কি আনন্দ হইয়াছেরে বাতি জ্বলছে ধীরে নিভে নারে। ঐ\n" +
                "৩. এক পয়সার সিদ্ধি দিয়া, তিন কল্কী সাজাইয়া,\n" +
                " গাজায় মারছে দোম, বলছে বোম, বম্ বম্ বম্ বম ভোলা\n" +
                "কলিতে ত্রিনাতের মেলা, তিন পয়সাতে যার মেলা, \n" +
                "কলিতে ত্রিনাতের মেলা ॥\n" +
                "তিন পয়সাতে হয় যার মেলা",

        /* 15 - তুমি অগতের গতি */
        "তুমি অগতের গতি তুমি'হে, \n" +
                "ব্রহ্মাণ্ডপ্রতি তব পদে এই মিনতি \n" +
                "ওহে দয়াময়, তাই দিন সকাতরে, \n" +
                "ডাকিহে বারে বারে।\n" +
                "১. মোচন কর এই সংসারের মায়াবি বন্ধন, \n" +
                "দ্বারা পুত্র পরিবার সকলি, হবে ছারকার\n" +
                "২. শমন এসে ধরলে কেসে কি হবে উপায় \n" +
                "হরি তখন তুমি দারাবে, যখন শিয়রে শমন দাড়াবে।\n" +
                "৩. তখন তুমি দাড়াবে, যখন কাল শমনে বেঁধে নিবে \n" +
                "তখন তুমি দাড়াবে তোমায় রাই কিশোরি \n" +
                "বামে নিয়ে তখন তুমি দাড়াবে ।",

        /* 16 - দিন গেলে ত্রিনাতের নাম লইয় সাধুর ভাই */
        "দিন গেলে ত্রিনাতের নাম লইয় সাধুর ভাই ॥\n" +
                "সারাদিন করিও ভাইরে গৃহবাসের কাজ, সন্ধ্যা হলে লইয় ঠাকুর ত্রিনাথের নাম ॥\n" +
                "অসময়ে দিলাম মেলা দেওয়া দিল ডাক ভাঙ্গিল কান্ডারির বৈঠা নৌকায় খাইল পাক ॥ ঐ\n" +
                "আমার ঠাকুর ত্রিনাথ যার বাড়িযায় এক পয়সার পান সুপারি, সবাইকে বিলায় ॥ ঐ\n" +
                "আমার ঠাকুর ত্রিনাথ যার বাড়িযায় এক পয়সার তৈল দিয়া তিন বাতি জ্বলায় ॥ ঐ\n" +
                "আমার ঠাকুর ত্রিনাথ যার বাড়িযায় এক পয়সার সিদ্ধি দিয়া তিন কল্কী সাজায় । ঐ\n" +
                "আমার ঠাকুর ত্রিনাথ যার বাড়িযায় জ্বর জারি মাথা ব্যাথা তরাসে পালায়।",

        /* 17 - নামটি বদন ভরে লওরে রাধে গোবিন্দ নাম */
        "নামটি বদন ভরে লওরে রাধে গোবিন্দ নাম।\n" +
                "১. এখন না নিলি নাম জিহ্বার আলসে, \n" +
                "পরকালে কি জব দিবি প্রভু জিজ্ঞাসিলে রে।\n" +
                "রাধে গোবিন্দ নাম। ঐ\n" +
                "২. ছোট ছোট ঘর খানি খোপে খোপে বেড়া \n" +
                "তাহার মধ্যে বিরাজ করে নবিন কিশরারে, \n" +
                "রাধে গোবিন্দ নাম।\n" +
                "নামটি বদন ভরে লও রে রাধে গোবিন্দনাম,\n" +
                "৩. ঘুম ঘুম কররে মন কিসের লাগিয়া, \n" +
                "একদিন ঘুমাইবীরে মন জনমের লাগিয়ারে \n" +
                "রাধে গোবিন্দ নাম নামটি বদন বরে, \n" +
                "লওরে রাধে গোবিন্দ নাম। ঐ",

        /* 18 - বিপদ বঞ্জন পতিত পাবণ শ্রী মধুসুধন জনার্ধন */
        "বিপদ বঞ্জন পতিত পাবণ শ্রী মধুসুদন জনার্ধন।\n" +
                "১. কে পারে চিনিতে, তোমারে জগতে, তুমি হও সর্ব্বভূতে নিরঞ্জন। ঐ\n" +
                "তুমি হও ব্রহ্মা, তুমি হও বিষ্ণু, তুমি দেব পঞ্চানন।\n" +
                "২. যত দেবগণ, তুমি নারায়ণ, তুমারি সৃজন ত্রিভুবণ।\n" +
                "আছে লক্ষ্মী স্বরস্বতী, কালী ভগবতী, তুমি ব্রহ্ম সনাতন। ঐ\n" +
                "৩. আমি দিন হীন, ভজন বিহীন, মায়ারি অধিন সর্বক্ষণ 1\n" +
                "যদি নিজ গুণে, ত্বরাও অধীনে, দিয়ে তোমার শ্রীচরণ। ঐ\n" +
                "৪. ঈশান বলে হরি নিবেদন করি, আমি দর্প করি ভবে একজন।\n" +
                "আসিবার কালে, এসেছি বলে, এখন আমার নাই স্মরণ। ঐ",

        /* 19 - বৃন্দাবন বিলাসিনি, রাই আমাদের */
        "বৃন্দাবন বিলাসিনি, রাই আমাদের রাই আমাদের " +
                "শ্যাম তোমাদের রাই আমাদের।\n" +
                "১. সুখ বলে আমার কৃষ্ণ জগতের গুরু, \n" +
                "সারি বলে আমার রাধা বাঞ্ছাকল্প তরু। ঐ\n" +
                "২. সুখ বলে আমার কৃষ্ণ মদন মোহন, \n" +
                "সারি বলে আমার রাধা বামে যতক্ষন নাইলে শুধুই মদন। ঐ\n" +
                "৩. সুখ বলে, আমার কৃষ্ণ গিরি দরে ছিল \n" +
                "সারি বলে, আমার রাধা শক্তি সঞ্চারিল।\n" +
                "নইলে পারবে কেন, সুখ বলে আমার কৃষ্ণ চূড়া বামে হেলে।\n" +
                "সারি বলে আমার রাধার চরণ পাবে বলে নইলে হালবে কেন। ঐ\n" +
                "৪. সুখ বলে আমার কৃষ্ণের চূড়ায় ময়ূর পাখা-\n" +
                "সারি বলে আমার রাধার নামটি তাতে লেখা নইলে পাখির পাখা। ঐ\n" +
                "সুখ সারির দুজনার দ্বন্ধ গুচে গেল, রাধা কৃষ্ণ \n" +
                "প্রিতে একবার হরি হরি বল সবে ব্রজে চল-ঐ",

        /* 20 - ভোর কীর্তন */
        "১. জয় রাঁধে জয় রাধে কৃষ্ণ জয় রাঁধে জয় রাঁধে ॥ " +
                "বল জয় রাঁধে জয় রাঁধে ॥\n" +
                "২. যশোদার প্রাণ ধন জাগরে নিল রতন। \n" +
                "সুখের নিশি প্রভাত হইল ॥ ঐ\n" +
                "৩. শ্রী বৃন্দাবনে কুসুম কাননে ভ্রমরায় হরি গুণ গায়রে ॥ ঐ\n" +
                "৪. শ্যামের বামেতে নবীন কিশোরী বহুরূপ সুন্দর সাঝে ॥ ঐ\n" +
                "৫. শ্যামের হাতে মোহন বাঁশরী রাঁধা রাঁধা রাঁধা বুলি সাজে ॥ ঐ\n" +
                "৬. নয়ন মেলিয়ে চাও কতরে নিন্দ্রা যাও ॥ \n" +
                "সুখের নিশি প্রভাত হইল ॥ঐ\n" +
                "৭. গগনে উঠিত ভানু জাগ জাগ রাই কানু।\n" +
                "জাগ জাগ হে গগনে উঠিত ভানু সুখের নিশি প্রভাত হইল। ঐ\n" +
                "৮. রাতুল চরনে সোনার নুপুর। রুনু জুনু রুনু জুনু বাজে ॥ ঐ\n" +
                "স্বামের মাথায় মোহন চুরা রাইয়ের মাথায় বেনী সাঝে। ঐ",

        /* 21 - মন একবার হরিবল হরি বল হরি বল */
        "মন একবার হরিবলহরি বল হরি বল। \n" +
                "হরি হরি, হরিবলে ভবসিন্দু পারে চল। ঐ\n" +
                "১. জলে হরি স্থলে হরি চন্দ্র হরি সূর্য্যে হরি \n" +
                "অণলে অণিলে হরি হরি ময় ভূমাণ্ডল ॥ ঐ\n" +
                "২. দেখ প্রহলাদ নামের গুণে না পুরিল, দ্বাবানলে \n" +
                "শিব গেল সন্নাসীর বেসে অজামীল বৈকুন্ঠ গেল । ঐ\n" +
                "৩. ক্ষুদাতৃষ্ণা পরি হরী মুখে বল হরি হরি \n" +
                "দুর্বলের বল হরি, হরি নাম পথের সম্বল। ঐ",

        /* 22 - মাধা ভয় কিরে তোর আয়রে আমার কাছে আয় */
        "মাধা ভয় কিরে তোর আয়রে আমার কাছে আয়\n" +
                "১. মাইরছিস মাইর আবার খাব তবু তোরে সঙ্গে নিব, \n" +
                "যশ-কীর্তি রেখে যাব নদিয়ায় ॥ ঐ\n" +
                "২. আমরা দুভাই তোমরা দুভাই দুভাই এসে নিব দুভাই। \n" +
                "দুভাইব প্রেমসিন্ধু নদিয়ায় ॥ ঐ\n" +
                "৩. গৌরবের চাঁদ গৌর হরি যার গৌরবে, গৌরব করি। \n" +
                "গৌরব করে জড়াইব রাঙ্গাঁ পায় ॥ ঐ\n" +
                "৪. গঙ্গাঁ জলে স্নান করাব অপরাধের ভাগী হব \n" +
                "যশ কীর্ত্তি রেখে যাবো নদিয়ায় ঐ",

        /* 23 - মাধা যেনে আয় নদিয়ায় কি মধুর ধনি শুনা যায় */
        "মাধা যেনে আয়, নদিয়ায় কি মধুর ধনি শুনা যায়\n" +
                "১. মাধা তুইনা গেলে আমি যাব আমি গৃহেতে রব আর কার আশায়। ঐ " +
                "২. নদিয়াতে এল দুটি ভাই তাদের নাম শুনেছি গৌর নিতাই\n" +
                "ভাই নামা বলি মাথায় বেঁধে, তারা হরি বল বলে নাচে গায়। ঐ\n" +
                "৩. কাল শুনেছি, এই হরি নাম লাগল বিষের প্রায়।\n" +
                "আজ কেন নাম মিঠা লাগে, ভাইরে এমন মধুর নাম আর শুনি নাই। ঐ\n" +
                "৪. জগা বলে শুনরে মাধা ভাই, তারা হরি নামের সারি গেয়ে তরী বেয়ে যায়।\n" +
                "জয় জয় রাধা নামে বাদাম দিয়ে তারা আনন্দ বাজারে চলে যায়। ঐ",

        /* 24 - রাধা কানুর মিলন হল */
        "১. রাধা কানুর মিলন হল, " +
                "জগতের আনন্দ হলরে।\n" +
                "২. রাধাঁ কানুর মিলন হল, \n" +
                "ভক্ত সবে হরি বলরে।\n" +
                "৩. সদানন্দ উদয় হলরে, \n" +
                "নিরানন্দ দূরে গেলরে।\n" +
                "৪. প্রেমানন্দ উদয় হলোরে, \n" +
                "এমন দিন আর কবে হবে রে। ঐ",

        /* 25 - লুট গান-১ */
        "লাগল হরি লুট নিতাইর আনন্দ বাজারে,\n" +
                "আনন্দ বাজারে নিতাই রসেরই বাজারে, \n" +
                "১. নবদ্বীপের ভক্তগণে, প্রেমানন্দে বাহুতুলে, প্রেমধ্বনি করে। \n" +
                "চিনি মুন্দা ফুল বাতাসা, দিতেছে ওজন করে। ঐ \n" +
                "২. যার যত মনবাঞ্চা শ্রী হরি পূরণ করে ॥ ঐ \n" +
                "৩. যার যত বাঞ্চা মনে, ভক্তি ভাবে লুঠ মানে হরির চরনে ॥ ঐ \n" +
                "হরিদাস খাদামচি হয়ে লুট বিলাইল শহরে ঐ।\n",

        /* 26 - লুট গান-২ */
        "সবে প্রেমানন্দে হরিবলরে ভাই\n" +
                "১. এই আনন্দে নেচে গেয়ে ব্রজের পথে চলে যাই ৷ \n" +
                "২. চৌদিকে খোল করতাল বাজে মধ্যে নাচে গৌর নিতাই, ঐ\n" +
                " আমারে নি হবে দয়া ব্রজের কিশোরি রাই ॥\n" +
                "৩. বল হরি বল হরি বলে, মধ্যে নাচে গৌর নিতাই, ঐ \n" +
                "বোবায় বলে হরি হরি, অন্ধে নয়ন মেলে চায় \n" +
                "৪. দক্ষিণে ললিতা সখি, বামেতে কিশোরি রাই, \n" +
                "চিনি মুণ্ডা ফুল বাতাস, হরির নামে লুট বিলাই ॥\n",

        /* 27 - লুট গান-৩ */
        "তোরা লুট নিবিকে আয়নারে, লাগলরে লুট নিতাইর বাজারে। \n" +
                "১. নিতাইর হাতে বাজল খোল, ভক্ত সবে হরি বল\n" +
                "কেহ উচ্চ, কেহ মধুর স্বরে।\n" +
                "২. নিত্যানন্দ বেপারী শ্রীচৈতন্য মোহরী,\n" +
                "কাটা দারী দিয়া বেপার করে।\n" +
                "৩. চিনতে পারলে খরিদ করে, কেহ যে ঘুরে মরে, \n" +
                "লাগলরে লুট নিতাইর বাজারে। ঐ\n" +
                "৪. হাতের রাজা নিত্যানন্দ ভক্ত, হল শ্রী চৈতন্য \n" +
                "মুন্সেদগিরী দিন অদ্বৈতেরে ॥\n" +
                "৫. নারদ মুনি মগ্ন হয়ে বীণা স্বরে গান করে ॥ ঐ\n" +
                "লাগলরে লুট নিতাইর বাজারে। ঐ\n" +
                "হরিদাস খাদাঞ্চি হয়ে লুট, বলাইল শহরে ॥ ঐ\n" +
                "লাগলরে লুট নিতাইর বাজারে।\n",

        /* 28 - লুট গান-৪ */
        "হরি নাম লস নাম লুটলরে ।\n" +
                "লুটল লুটল লুটল রে ॥ ঐ\n" +
                "১. শিব জপেছে পঞ্চ মুখে লুটলরে ॥\n" +
                "ব্রহ্মা জপে চতুর মুখে লুটল রে ॥\n" +
                "২. পাতালের পাষাণ্ডি সবে লুটল রে ॥\n" +
                "জীব্বা আপন বস থাকিতে লুটলরে ।\n" +
                "৩. নারদ জপে বীনা সুরে লুটলরে ॥\n" +
                "সম্মুখেতে ঘট বসায়ো লুটলরে ॥\n" +
                "৪. গনার দীন ফোরায়া গেল লুটলরে সমন ফিরে পাছে পাছে লুটলরে ||\n",

        /* 29 - লুট গান-৫ */
        "লুট পইরাছে লুটের বাহার,\n" +
                "লুট নেরে তোরা ।\n" +
                "১. লুটে নেরে তোরা ব্রজের বালক যারা ॥\n" +
                "২. ব্রজের বালক তোরা নয়রে\n" +
                "গোপীর মন হরা ॥ ঐ\n" +
                "৩. চিনি মোণ্ডা ফুল বাতাশা,\n" +
                "সন্দেশ জোরা জোড়া ৷৷\n" +
                "৪. চৌদিকে খোল করতাল,\n" +
                "বাজে মধ্যে নাচে গৌরা ॥\n" +
                "৫. পোলা পাইনে লুটে খেল, আপছুশ করল বুইরায় ॥ ঐ\n",

        /* 30 - লুট গান-৬ */
        "হরির নাম হল অমুল্যধন, \n" +
                "লুট পইরাছে লুইটা নেরে মন\n" +
                "১. চৌদিকে খোল করতাল বাজে \n" +
                "মধ্যে হরি নারায়ন৷৷\n" +
                "২. চিনি মোন্ডা ফুল বাতাসা, \n" +
                "হরির নামে নিবেদন ॥ ঐ\n" +
                "৩. কেহ দেয়রে ছঠাক আধবা,\n" +
                "কেহ দেয় রে দুই চার মন । ঐ\n" +
                "৪. বুঝায় বলে হরি হরি অন্ধে, \n" +
                "মেলে দুই নয়ন ॥\n" +
                "৫. লুট বইরাছে, লুইটা নেরে মন ।\n" +
                "যার যত মনের বাঞ্ছা\n" +
                "শ্রী হরি করেন পূরন ॥\n",

        /* 31 - লুট গান -৭ */
        "হরি লুট পইরাছে আনন্দের আর সীমা নাই \n" +
                "চাঁন বদনে হরি বল ভাই\n" +
                "১. এই আনন্দে নেছে গেয়ে, \n" +
                "ব্রজের পথে চলে যাই ॥\n" +
                "২. চৌদিকে খোল করতাল বাজে, \n" +
                "মধ্যে নাচে গৌর নিতাই ॥\n" +
                "৩. চিনি মোণ্ডা ফুল বাতাসা, \n" +
                "হরির নামে লুট বিলাই ॥ \n" +
                "৪. আমারে নি, হবে দয়া ব্রজের কিশোরী রাই ॥ \n" +
                "৫. দক্ষীনে ললিতা সখী\n" +
                "বাঁমেতে কিশোরি রাই। \n" +
                "৬. বোবায় বলে হরি হরি অন্ধে নয়ন মেলে চাই । ঐ\n",

        /* 32 - শচী কেন্দে বলে কোথায় রইলি */
        "শচী কেন্দে বলে কোথায় রইলি প্রাণের নিমাই, \n" +
                "আমায় দেখা দাও হে ত্বাপিত প্রাণ জুরাই।\n" +
                "১. ওরে অনেক দিনের সেই চন্দ্র বদন, \n" +
                "দেখা দিয়ে প্রাণ রাখ দুঃখিনির জীবন। ঐ \n" +
                "একবার মা বল বুলি, বলরে শুনি কোলে আয়রে নিয়ে যায়।\n" +
                "২. একদিন এ ঘর হতে ঐ ঘরে যাইতে, \n" +
                "আচল ধরে কাঁদছে নিমাই দুগ্ধ দাও খাইতে।\n" +
                "আমার প্রয়োদরে গলছে দুগ্ধ খাওয়াতে প্রানের নিমাই ॥ ঐ\n" +
                "৩. একদিন কোথা হতে ভারতী এল, \n" +
                "অথিত বেশে ঘরে এসে প্রমাদ ঘটাইল।\n" +
                "৪. সেই যে কিনা মন্ত্র কর্ণে দিয়ে সন্নাসী করলে নিমাই। \n" +
                "নিমাইরে ওরে নিমাই, সন্নাসী করলী নিমাই ॥ ঐ",

        /* 33 - হরি দিন ত গেল সন্ধ্যা হল পার কর আমারে */
        "হরি দিন ত গেল সন্ধা হল পার কর আমারে। \n" +
                "তুমি পারের কর্তা যেনে বার্তা, তাই ডাকি তোমারে। ঐ\n" +
                "১. হাতে কড়ি নাই যার, তারে তুমি করহে পার, \n" +
                "আমি দিন ভিক্ষারি নাইকো করি দেখ ঝুলি-ঝেরে। ঐ\n" +
                "২. পারের ঘাটে এসে আমি রইলাম বসে, \n" +
                "যারা পাছে এল আগে গেল আমি রইলাম পারে। ঐ\n" +
                "৩. (ঝুমুর)-হরি হে দিন দয়াময়, তুমি পারের কর্তা তুমি \n" +
                "পারের কর্তা-যেনে বার্তা তাই ডাকি তোমারে। ঐ",

        /* 34 - হরি বলে বাহু তোলে নেছে আয় */
        "হরি বলে বাহু তোলে নেচে আয়,\n" +
                "১. পতিত পাবণ গৌর হরি রাখবো তোমায় রাঙ্গা পায়।\n" +
                "হরি বলে বাহু তোলে নেচে আয়\n" +
                "২. গৌর নাচে নিতাই নাচে শ্রীবাস আঙ্গিনার মাঝে, \n" +
                "জগা-মাধা দু'ভাই নাচে, নেচে নেচে প্রেম বিলায়।\n" +
                "হরি বলে বাহু তোলে নেচে আয়,\n" +
                "৩. আনন্দে দু'বাহু তুলে, জয় রাধা শ্রী রাধা বলে, \n" +
                "গৌরাক্ষনে হাসে ক্ষনে কাঁদে ধুলায় গড়া গড়ি যায়। ঐ\n" +
                "৪. প্রেমেমত্ত হয়ে গৌরা, মুখে বলে রারা রারা, \n" +
                "দু'নয়নে বহে ধারা, ধারায় অঙ্গ ভেসে যায়।\n" +
                "হরি বলে বাহু তুলে নেচে আয়,\n" +
                "৫. মনমোহন কয় নামের কাছে, এই জগতে কি ধন আছে। \n" +
                "নামে রুচি যার হয়েছে দূরে গেছে সমন দায়। ঐ \n" +
                "হরি বলে বাহু তুলে নেচে আয়। ঐ"
    )

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_main)

        val toolbar = findViewById<MaterialToolbar>(R.id.topBar)
        toolbar.title = "আড়াই দিনের কীর্তনের গান"
        toolbar.setTitleTextColor(resources.getColor(R.color.toolbar_text, null))


        val listView = findViewById<ListView>(R.id.songListView)

        val adapter = ArrayAdapter(
            this,
            android.R.layout.simple_list_item_1,
            songList
        )

        listView.adapter = adapter

        listView.setOnItemClickListener { _, _, position, _ ->
            val intent = Intent(this, LyricsActivity::class.java)
            intent.putExtra("title", songList[position])
            intent.putExtra("lyrics", lyricsList[position])
            startActivity(intent)
        }
    }
}