package com.example.kirton_song

import android.content.Intent
import android.os.Bundle
import android.widget.ArrayAdapter
import android.widget.ListView
import androidx.appcompat.app.AppCompatActivity
import com.google.android.material.appbar.MaterialToolbar

class MainActivity : AppCompatActivity() {

    private val songList = listOf(
        "লুট গান-১",
        "লুট গান-২",
        "লুট গান-৩",
        "লুট গান-৪",
        "লুট গান-৫",
        "লুট গান-৬",
        "লুট গান -৭"
    )

    private val lyricsList = listOf(
        "লাগল হরি লুট নিতাইর আনন্দ বাজারে,\n" +
                "আনন্দ বাজারে নিতাই রসেরই বাজারে, \n" +
                "১. নবদ্বীপের ভক্তগণে, প্রেমানন্দে বাহুতুলে, প্রেমধ্বনি করে। \n" +
                "চিনি মুন্দা ফুল বাতাসা, দিতেছে ওজন করে। ঐ \n" +
                "২. যার যত মনবাঞ্চা শ্রী হরি পূরণ করে ॥ ঐ \n" +
                "৩. যার যত বাঞ্চা মনে, ভক্তি ভাবে লুঠ মানে হরির চরনে ॥ ঐ \n" +
                "হরিদাস খাদামচি হয়ে লুট বিলাইল শহরে ঐ।\n",
        "সবে প্রেমানন্দে হরিবলরে ভাই\n" +
                "১. এই আনন্দে নেচে গেয়ে ব্রজের পথে চলে যাই ৷ \n" +
                "২. চৌদিকে খোল করতাল বাজে মধ্যে নাচে গৌর নিতাই, ঐ\n" +
                " আমারে নি হবে দয়া ব্রজের কিশোরি রাই ॥\n" +
                "৩. বল হরি বল হরি বলে, মধ্যে নাচে গৌর নিতাই, ঐ \n" +
                "বোবায় বলে হরি হরি, অন্ধে নয়ন মেলে চায় \n" +
                "৪. দক্ষিণে ললিতা সখি, বামেতে কিশোরি রাই, \n" +
                "চিনি মুণ্ডা ফুল বাতাস, হরির নামে লুট বিলাই ॥\n",
        "তোরা লুট নিবিকে আয়নারে, লাগলরে লুট নিতাইর বাজারে। \n" +
                "১. নিতাইর হাতে বাজল খোল, ভক্ত সবে হরি বল\n" +
                "কেহ উচ্চ, কেহ মধুর স্বরে।\n" +
                "২. নিত্যানন্দ বেপারী শ্রীচৈতন্য মোহরী,\n" +
                "কাটা দারী দিয়া বেপার করে।\n" +
                "৩. চিনতে পারলে খরিদ করে, কেহ যে ঘুরে মরে, \n" +
                "লাগলরে লুট নিতাইর বাজারে। ঐ\n" +
                "৪. হাতের রাজা নিত্যানন্দ ভক্ত, হল শ্রী চৈতন্য \n" +
                "মুন্সেদগিরী দিন অদ্বৈতেরে ॥\n" +
                "৫. নারদ মুনি মগ্ন হয়ে বীণা স্বরে গান করে ॥ ঐ\n" +
                "লাগলরে লুট নিতাইর বাজারে। ঐ\n" +
                "হরিদাস খাদাঞ্চি হয়ে লুট, বলাইল শহরে ॥ ঐ\n" +
                "লাগলরে লুট নিতাইর বাজারে।\n",
        "হরি নাম লস নাম লুটলরে ।\n" +
                "লুটল লুটল লুটল রে ॥ ঐ\n" +
                "১. শিব জপেছে পঞ্চ মুখে লুটলরে ॥\n" +
                "ব্রহ্মা জপে চতুর মুখে লুটল রে ॥\n" +
                "২. পাতালের পাষাণ্ডি সবে লুটল রে ॥\n" +
                "জীব্বা আপন বস থাকিতে লুটলরে ।\n" +
                "৩. নারদ জপে বীনা সুরে লুটলরে ॥\n" +
                "সম্মুখেতে ঘট বসায়ো লুটলরে ॥\n" +
                "৪. গনার দীন ফোরায়া গেল লুটলরে সমন ফিরে পাছে পাছে লুটলরে ||\n",
        "লুট পইরাছে লুটের বাহার,\n" +
                "লুট নেরে তোরা ।\n" +
                "১. লুটে নেরে তোরা ব্রজের বালক যারা ॥\n" +
                "২. ব্রজের বালক তোরা নয়রে\n" +
                "গোপীর মন হরা ॥ ঐ\n" +
                "৩. চিনি মোণ্ডা ফুল বাতাশা,\n" +
                "সন্দেশ জোরা জোড়া ৷৷\n" +
                "৪. চৌদিকে খোল করতাল,\n" +
                "বাজে মধ্যে নাচে গৌরা ॥\n" +
                "৫. পোলা পাইনে লুটে খেল, আপছুশ করল বুইরায় ॥ ঐ\n",
        "হরির নাম হল অমুল্যধন, \n" +
                "লুট পইরাছে লুইটা নেরে মন\n" +
                "১. চৌদিকে খোল করতাল বাজে \n" +
                "মধ্যে হরি নারায়ন৷৷\n" +
                "২. চিনি মোন্ডা ফুল বাতাসা, \n" +
                "হরির নামে নিবেদন ॥ ঐ\n" +
                "৩. কেহ দেয়রে ছঠাক আধবা,\n" +
                "কেহ দেয় রে দুই চার মন । ঐ\n" +
                "৪. বুঝায় বলে হরি হরি অন্ধে, \n" +
                "মেলে দুই নয়ন ॥\n" +
                "৫. লুট বইরাছে, লুইটা নেরে মন ।\n" +
                "যার যত মনের বাঞ্ছা\n" +
                "শ্রী হরি করেন পূরন ॥\n",
        "হরি লুট পইরাছে আনন্দের আর সীমা নাই \n" +
                "চাঁন বদনে হরি বল ভাই\n" +
                "১. এই আনন্দে নেছে গেয়ে, \n" +
                "ব্রজের পথে চলে যাই ॥\n" +
                "২. চৌদিকে খোল করতাল বাজে, \n" +
                "মধ্যে নাচে গৌর নিতাই ॥\n" +
                "৩. চিনি মোণ্ডা ফুল বাতাসা, \n" +
                "হরির নামে লুট বিলাই ॥ \n" +
                "৪. আমারে নি, হবে দয়া ব্রজের কিশোরী রাই ॥ \n" +
                "৫. দক্ষীনে ললিতা সখী\n" +
                "বাঁমেতে কিশোরি রাই। \n" +
                "৬. বোবায় বলে হরি হরি অন্ধে নয়ন মেলে চাই । ঐ\n"
    )

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_main)

        val toolbar = findViewById<MaterialToolbar>(R.id.topBar)
        toolbar.title = "আড়াই দিনের কীর্তনের গান © Chayan"

        val listView = findViewById<ListView>(R.id.songListView)

        val adapter = ArrayAdapter(
            this,
            android.R.layout.simple_list_item_1,
            songList
        )

        listView.adapter = adapter

        listView.setOnItemClickListener { _, _, position, _ ->
            val intent = Intent(this, LyricsActivity::class.java)
            intent.putExtra("title", songList[position])
            intent.putExtra("lyrics", lyricsList[position])
            startActivity(intent)
        }
    }
}